_posts/2016-07-08-mariadb(mysql).html
---
title: "MariaDB(MySQL)数据库"
date: 2016-07-08
layout: post
categories: 
- 数据库
tags: 
- 运维 
- 数据库 
- MySQL
published: true
comments: 
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline10">1. 数据库相关知识</a>
<ul>
<li><a href="#orgheadline1">数据结构模型</a></li>
<li><a href="#orgheadline2">RDMBS设计范式</a></li>
<li><a href="#orgheadline3">事务</a></li>
<li><a href="#orgheadline4">数据存储协议</a></li>
<li><a href="#orgheadline8">数据基础概念</a>
<ul>
<li><a href="#orgheadline5">约束</a></li>
<li><a href="#orgheadline6">索引</a></li>
<li><a href="#orgheadline7">关系运算</a></li>
</ul>
</li>
<li><a href="#orgheadline9">数据抽象</a></li>
</ul>
</li>
<li><a href="#orgheadline12">2. SQL</a>
<ul>
<li><a href="#orgheadline11">SQL基础概念</a></li>
</ul>
</li>
<li><a href="#orgheadline13">3. MariaDB</a></li>
</ul>
</div>
</div>
<p>
TODO
</p>




<hr  />
<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">1</span> 数据库相关知识</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1">数据结构模型</h3>
<div class="outline-text-3" id="text-orgheadline1">
<ul class="org-ul">
<li>层次模型: 树状结构</li>
<li>网状结构</li>
<li>关系模型
<ul class="org-ul">
<li>将数据组织成二维关系: row,column</li>
<li>关系模型的分类
<ul class="org-ul">
<li>关系模型</li>
<li>实体-关系模型</li>
<li>基于对象的关系模型</li>
<li>半结构化的关系模型</li>
</ul></li>
</ul></li>
<li>数据库管理系统: DBMS
<ul class="org-ul">
<li>关系型数据库管理系统: RDBMS</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">RDMBS设计范式</h3>
<div class="outline-text-3" id="text-orgheadline2">
<p>
设计关系数据库时，遵从不同的规范要求，设计出合理的关系型数据库，这些不同的规范要求被称为不同的范式，各种范式呈递次规范，越高的范式数据库冗余越小。
</p>
<ol class="org-ol">
<li>第一范式(1NF)
所谓第一范式(1NF)是指在关系模型中，对域添加的一个规范要求，所有的域都应该是原子性的，即数据库表的每一列都是不可分割的原子数据项，而不能是集合，数组，记录等非原子数据项。即实体中的某个属性有多个值时，必须拆分为不同的属性。在符合第一范式(1NF)表中的每个域值只能是实体的一个属性或一个属性的一部分。简而言之，第一范式就是无重复的域。</li>
<li>第二范式(2NF)
第二范式(2NF)要求实体的属性完全依赖于主关键字。所谓完全依赖是指不能存在仅依赖主关键字一部分的属性，如果存在，那么这个属性和主关键字的这一部分应该分离出来形成一个新的实体，新实体与原实体之间是一对多的关系。为实现区分通常需要为表加上一个列，以存储各个实例的唯一标识。简而言之，第二范式就是在第一范式的基础上属性完全依赖于主键。</li>
<li>第三范式(3NF)
第三范式(3NF)是第二范式(2NF)的一个子集，即满足第三范式(3NF)必须满足第二范式(2NF)。简而言之，第三范式(3NF)要求一个关系中不包含已在其它关系已包含的非主关键字信息。简而言之，第三范式就是属性不依赖于其它非主属性，也就是在满足2NF的基础上，任何非主属性不得传递依赖于主属性。</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">事务</h3>
<div class="outline-text-3" id="text-orgheadline3">
<p>
事务（Transaction）是并发控制的单位，是用户定义的一个操作序列。这些操作要么都做，要么都不做，是一个不可分割的工作单位。
</p>
<ul class="org-ul">
<li>事务的特性
<ul class="org-ul">
<li>A: 原子性，整个事务是一个整体</li>
<li>C：一致性，一个状态转换到另一个状态</li>
<li>I: 隔离性，一个事务的执行不能被其他事务干扰</li>
<li>D：持久性，一个事务一旦提交，它对数据库中数据的改变就应该是永久性的</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">数据存储协议</h3>
<div class="outline-text-3" id="text-orgheadline4">
<p>
数据存储协议是一个C/S架构的应用层协议
</p>
<ul class="org-ul">
<li>Server: 监听于套拼字，接收并处理客户端的应用请求</li>
<li>Client
<ul class="org-ul">
<li>程序接口: CLI、GUI</li>
<li>应用编程接口: ODBC(Open DataBase Connection)</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8">数据基础概念</h3>
<div class="outline-text-3" id="text-orgheadline8">
</div><div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5">约束</h4>
<div class="outline-text-4" id="text-orgheadline5">
<p>
约束(constraint): 向数据表提供的数据要遵守的限制
</p>
<ul class="org-ul">
<li>主键：一个或多个字段的组合，填入的数据必须能在本表中唯一标识本行，NOT NULL，且一个表只能存在一个</li>
<li>唯一键：一个或多个字段的组合，填入的数据必须能在本表中唯一标识本行，允许为NULL</li>
<li>外键：一个表中的某字段可填入数据取决于另一个表的主键已有的数据</li>
<li>检查性：数据的表达式限制</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6">索引</h4>
<div class="outline-text-4" id="text-orgheadline6">
<p>
索引：将表中的一个或多个字段中的数据复制一份另存，并且此些需要按特定次序排序存储
</p>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7">关系运算</h4>
<div class="outline-text-4" id="text-orgheadline7">
<ul class="org-ul">
<li>选择：挑选出符合条件的行</li>
<li>投影：挑选出需要的字段</li>
<li>连接：根据条件连接多个表</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9">数据抽象</h3>
<div class="outline-text-3" id="text-orgheadline9">
<ul class="org-ul">
<li>物理层：决定数据的存储格式，即RDBMS在磁盘上如何组织文件</li>
<li>逻辑层：描述DB存储什么数据，以及数据间存在什么样的关系</li>
<li>视图层：描述DB中的部分数据</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12"><span class="section-number-2">2</span> SQL</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11">SQL基础概念</h3>
<div class="outline-text-3" id="text-orgheadline11">
<p>
SQL(Structure Query Language)是一个结构化查询语言，通过SQL解释器执行
</p>
</div>
</div>
</div>


<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13"><span class="section-number-2">3</span> MariaDB</h2>
</div>
